---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableManager.Dispose
source: html/c2168c47-887f-9418-5534-4b905623f579.htm
---
# Autodesk.Revit.DB.FamilySizeTableManager.Dispose Method

Releases all resources used by the FamilySizeTableManager

## Syntax (C#)
```csharp
public void Dispose()
```